```
$ terraform plan -target='module.production_env.module.dokku-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["51820"]' -out=tfplan
module.production_env.module.dokku-vm.openstack_networking_secgroup_v2.main-sg: Refreshing state... [id=d1b104c9-cdeb-441f-8ed5-8def5f6d2a93]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.production_env.module.dokku-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["51820"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "tcp4-ingress" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 51820
      + port_range_min    = 51820
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = "d1b104c9-cdeb-441f-8ed5-8def5f6d2a93"
      + tenant_id         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the result of this plan may not represent all of the changes requested by the current configuration.
│ 
│ The -target option is not for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it as
│ part of an error message.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
│   on provider.tf line 34, in provider "openstack":
│   34: provider "openstack" {
│ 
│ Users not using loadbalancer resources can ignore this message. Support for neutron-lbaas will be removed on next major release. Octavia will be the only supported method for loadbalancer
│ resources. Users using octavia will have to remove 'use_octavia' option from the provider configuration block. Users using neutron-lbaas will have to migrate/upgrade to octavia.
│ 
│ (and 3 more similar warnings elsewhere)
╵

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

$ terraform apply tfplan 
module.production_env.module.dokku-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["51820"]: Creating...
module.production_env.module.dokku-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["51820"]: Creation complete after 2s [id=58ffd7e4-0b7e-4c52-9145-5c9126b423c8]
╷
│ Warning: Applied changes may be incomplete
│ 
│ The plan was created with the -target option in effect, so some changes requested in the configuration may have been ignored and the output values may not be fully updated. Run the
│ following command to verify that no other changes are pending:
│     terraform plan
│ 
│ Note that the -target option is not suitable for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically
│ suggests to use it as part of an error message.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
│   on provider.tf line 34, in provider "openstack":
│   34: provider "openstack" {
│ 
│ Users not using loadbalancer resources can ignore this message. Support for neutron-lbaas will be removed on next major release. Octavia will be the only supported method for loadbalancer
│ resources. Users using octavia will have to remove 'use_octavia' option from the provider configuration block. Users using neutron-lbaas will have to migrate/upgrade to octavia.
╵

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```